[BallisticShield_CV X2WeaponTemplate]
FriendlyName="Ballistic Shield"
FriendlyNamePlural="Ballistic Shields"
BriefSummary="Shields are one of the oldest forms of additional protection known to mankind. We were able to scrap together enough metallic and ceramic armored plates to form a basic ballistic shield capable of withstanding a moderate amount of punishment."
TacticalText="Shields are one of the oldest forms of additional protection known to mankind. We were able to scrap together enough metallic and ceramic armored plates to form a basic ballistic shield capable of withstanding a moderate amount of punishment.<br/><Bullet/> Melee attacks with shields disorient enemies.<br/><Bullet/> Shiels are upgraded alongside soldier armor.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."

[BallisticShield_MG X2WeaponTemplate]
FriendlyName="Alloy Shield"
FriendlyNamePlural="Alloy Shields"
BriefSummary="The use of alien alloys has not only made our ballistic shields stronger, but lighter as well. Complex polymer and ceramic materials allow for better heat distribution, making users less likely to be injured by shrapnel and molten material from their own protective gear. Integrated LED tablet allows monitoring the tactical situation without being exposed to enemy fire."
TacticalText="The use of alien alloys has not only made our ballistic shields stronger, but lighter as well. Complex polymer and ceramic materials allow for better heat distribution, making users less likely to be injured by shrapnel and molten material from their own protective gear. Integrated LED tablet allows monitoring the tactical situation without being exposed to enemy fire.<br/><Bullet/> Melee attacks with shields disorient enemies.<br/><Bullet/> Shiels are upgraded alongside soldier armor.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."

[BallisticShield_BM X2WeaponTemplate]
FriendlyName="Powered Shield"
FriendlyNamePlural="Powered Shields"
BriefSummary="Advances in energy cell miniaturization allow this shield to provide not only conventional kinetic protection, but more exotic like energy repulsion as well. An integrated holographic system ensures the user's situational awareness remains unimpaired."
TacticalText="Advances in energy cell miniaturization allow this shield to provide not only conventional kinetic protection, but more exotic like energy repulsion as well. An integrated holographic system ensures the user's situational awareness remains unimpaired.<br/><Bullet/> Melee attacks with shields disorient enemies.<br/><Bullet/> Shiels are upgraded alongside soldier armor.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."

[BallisticShield_CV X2AbilityTemplate]
LocFriendlyName="Ballistic Shield"
LocHelpText="Grants <Ability:BS_TAG_SHIELD_POINTS_CV/> shield points to the user and provides low cover for adjacent units."
LocLongDescription=""Grants <Ability:BS_TAG_SHIELD_POINTS_CV/> shield points to the user and provides low cover for adjacent units."
LocFlyOverText="Ballistic Shield"

[BallisticShield_MG X2AbilityTemplate]
LocFriendlyName="Alloy Shield"
LocHelpText="Grants <Ability:BS_TAG_SHIELD_POINTS_MG/> shield points to the user and provides low cover for adjacent units."
LocLongDescription="Grants <Ability:BS_TAG_SHIELD_POINTS_MG/> shield points to the user and provides low cover for adjacent units."
LocFlyOverText="Alloy Shield"

[BallisticShield_BM X2AbilityTemplate]
LocFriendlyName="Powered Shield"
LocHelpText="Grants <Ability:BS_TAG_SHIELD_POINTS_BM/> shield points to the user and provides low cover for adjacent units."
LocLongDescription="Grants <Ability:BS_TAG_SHIELD_POINTS_BM/> shield points to the user and provides low cover for adjacent units."
LocFlyOverText="Powered Shield"


[SparkBallisticShield_CV X2WeaponTemplate]
FriendlyName="SPARK Shield"
FriendlyNamePlural="SPARK Shields"
BriefSummary="The SPARK-sized version of a tactical ballistic shield is made from the same alloys as the SPARK armor itself. Its sheer size and extendable flaps allow the SPARK to function as a mobile fortress."
TacticalText="The SPARK-sized version of a tactical ballistic shield is made from the same alloys as the SPARK armor itself. Its sheer size and extendable flaps allow the SPARK to function as a mobile fortress.<br/><Bullet/> Melee attacks with shields stun enemies.<br/><Bullet/> Shiels are upgraded alongside soldier armor.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."

[SparkBallisticShield_MG X2WeaponTemplate]
FriendlyName="Kinetic Shield"
FriendlyNamePlural="Kinetic Shields"
BriefSummary="Essentially a chunk of a crashed UFO's outer hull, the Kinetic Shield is capable of absorbing kinetic energy, reducing the impact strength of ballistic projectiles. Extendable flaps can be used to provide additional protection to nearby units."
TacticalText="Essentially a chunk of a crashed UFO's outer hull, the Kinetic Shield is capable of absorbing kinetic energy, reducing the impact strength of ballistic projectiles. Extendable flaps can be used to provide additional protection to nearby units.<br/><Bullet/> Melee attacks with shields stun enemies.<br/><Bullet/> Shiels are upgraded alongside soldier armor.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."

[SparkBallisticShield_BM X2WeaponTemplate]
FriendlyName="Elerium Shield"
FriendlyNamePlural="Elerium Shields"
BriefSummary="The Elerium Shield is based on the same technology as the Warden powered exosuit armor, and additionally uses the elerium energy field to neutralize incoming projectiles. Additional mag-lev shield generates allow extending the shield to offer extra protection to nearby units."
TacticalText="The Elerium Shield is based on the same technology as the Warden powered exosuit armor, and additionally uses the elerium energy field to neutralize incoming projectiles. Additional mag-lev shield generates allow extending the shield to offer extra protection to nearby units.<br/><Bullet/> Melee attacks with shields stun enemies.<br/><Bullet/> Shiels are upgraded alongside soldier armor.<br/><Bullet/> Carrying a shield encumbers the soldier, resulting in a <Ability:BS_TAG_SHIELD_MOBILITY_PENALTY/> Mobility and <Ability:BS_TAG_SHIELD_AIM_PENALTY/> Aim penalties."

[SparkBallisticShield_CV X2AbilityTemplate]
LocFriendlyName="SPARK Shield"
LocHelpText="Grants <Ability:BS_TAG_SPARK_SHIELD_POINTS_CV/> shield points to the user and provides low cover for adjacent units."
LocLongDescription="Grants <Ability:BS_TAG_SPARK_SHIELD_POINTS_CV/> shield points to the user and provides low cover for adjacent units."
LocFlyOverText="SPARK Shield"

[SparkBallisticShield_MG X2AbilityTemplate]
LocFriendlyName="Kinetic Shield"
LocHelpText="Grants <Ability:BS_TAG_SPARK_SHIELD_POINTS_MG/> shield points to the user and provides low cover for adjacent units."
LocLongDescription="Grants <Ability:BS_TAG_SPARK_SHIELD_POINTS_MG/> shield points to the user and provides low cover for adjacent units."
LocFlyOverText="Kinetic Shield"

[SparkBallisticShield_BM X2AbilityTemplate]
LocFriendlyName="Elerium Shield"
LocHelpText="Grants <Ability:BS_TAG_SPARK_SHIELD_POINTS_BM/> shield points to the user and provides low cover for adjacent units."
LocLongDescription="Grants <Ability:BS_TAG_SPARK_SHIELD_POINTS_BM/> shield points to the user and provides low cover for adjacent units."
LocFlyOverText="Elerium Shield"


[BallisticShield_GenerateCover X2AbilityTemplate]
LocFriendlyName="Ballistic Shield"
LocHelpText="Grants low cover to adjacent units."
LocLongDescription="Grants low cover to adjacent units."
LocFlyOverText="Ballistic Shield"

[ShieldBash X2AbilityTemplate]
LocFriendlyName="Shield Bash"
LocHelpText="Perform a melee attack with your shield."
LocLongDescription="Perform a melee attack with your shield."
LocFlyOverText="Shield Bash"

[ShieldWall X2AbilityTemplate]
LocFriendlyName="Shield Wall"
LocHelpText="Provide high cover to adjacent units and receive <Ability:BS_TAG_SHIELD_WALL_DEFENSE/> defense until the beginning of your next turn."
LocLongDescription="Provide high cover to adjacent units and receive <Ability:BS_TAG_SHIELD_WALL_DEFENSE/> defense until the beginning of your next turn."
LocFlyOverText="Shield Wall"

